#+title: What will it cost to carry and remove this dependency?
#+author: JEG2
#+date: <2025-08-06 Wed>
#+draft: True

This article is part of the series [[https://programmersstone.blog/posts/jeg2s-questions/][JEG2's Questions]].

I've built a lot of applications with a lot of teams.  I've seen a lot of the problems with software development.  There are two problems that I've seen so often that I believe they are worth looking out for at all times.  The first of those is the accumulation of high cost dependencies.

# more

* The Math of Dependencies

We all use dependencies in our programming and I am in no way against that.  If you're building an Elixir web application, you probably start with Phoenix.  If you use the default options in your new Phoenix project, you'll need to set up the relational database that it is expecting.  Both of those make sense.  You don't want to interpret HTTP from scratch and you're going to need somewhere to stick your application's data.

Did we really just agree to two dependencies, though?  I just created a new default Phoenix application and counted the dependencies it downloaded.  It was 38.  I'm not saying that's bad.  I know some frameworks that fetch considerably more.  It's also not just two.

So what's the problem?  The problem is that programming is an endless struggle to manage the complexity of our growing systems.  We have to add features to them to make them useful and every time we do, it complicates what we are dealing with next time.  These complications compound with each change, kind of similar to interest on a credit card.

Let's imagine that each dependency we add slows our effort by a trivial 1%.  In that case, it doesn't take 100 dependencies to double the amount of effort needed to make changes to the application.  If we call our normal effort ~1~, we can see that it is more than doubled with the addition of the 70th dependency:

#+begin_src elixir :session none
  1
  |> Stream.iterate(fn n -> n * 1.01 end)
  |> Stream.drop(1)
  |> Stream.take(70)
  |> Enum.at(-1)
#+end_src

#+RESULTS:
: 2.006763368395386

If we did in fact add 100 dependencies, we would be closer to tripling our effort than doubling it:

#+begin_src elixir :session none
  1
  |> Stream.iterate(fn n -> n * 1.01 end)
  |> Stream.drop(1)
  |> Stream.take(100)
  |> Enum.at(-1)
#+end_src

#+RESULTS:
: 2.7048138294215294

Again, we're still talking about dependencies that I think are very easy to justify.  Not all dependencies are created equal.  There are plenty of situations where we are increasing future effort by a lot more than 1%.

